#დავალება1:
"""შექმენით სია სადაც შეინახავთ თქვენთვის საყვარელ ფილბეს და დაბეჭდეთ მთლიანი სია/ კონკრეტული ფილმი"""
my_favorite_movies = [
    "ბრონქსის ზღაპარი",
    "ჰაᲩიკო",
    " ჰარი პოტერი ",
]

#კონკრეტული ფილმი
print(my_favorite_movies[0])

#დავალება2:
"""შექმენით 2 სია და გააერთიანეთ ისინი"""

list1 = [
    "ბრონქსის ზღაპარი",
]

list2 = [
    "ჰაᲩიკო",
    " ჰარი პოტერი ",
]

combined = list1 + list2
print(combined)

#დავალება3:
"""შექმენით სტრინგი მაგ. თქვენი სახელი, და გამოიტანეთ სახელის პირველი და ბოლო სიმბოლო"""

name = "giorgi"

first = name[0]

last = name[-1]
print("name's first letter is",first,"name 's last letter is",last)

#დავალება4:
"""შექმენით სია და სტრინგი ხოლო შემდეგ დაბეჭდეთ len ფუნქციის გამოყენებით მათი ზომა"""

car_list = [
    "BMW,"
    "MASERETI",
    "FERRARI",
    "ALFA ROMEO"    
]
print(len(car_list))

string = "GOA BEST"
print(len(string))


#დავალება5:
"""შეცვალეთ სიიდან რომელიმე მნიშვნელობა (ჯერ გაიარეთ სოლოლეარნი)"""
 
games = [
    "minecraft",
    "cg go",
]
games[1] = "sololearn"
print(games)


#დავალება6:
"""შექმენით რიცხვების სია სადაც 10 რიცხვს შეიტანთ, გამოიტანეთ პირელ ინდექსა და ბოლო ინდექსზე მყოფი ელემენტების ჯამი"""

number = [1,2,3,4,5,6,7,8,9,10]

print(number[0] + number[-1])
